In [1]:
import pandas as pd 
import numpy as np
from sqlalchemy import create_engine
import sqlalchemy
import pymysql
from getpass import getpass
from mysql.connector import connect, Error

import warnings
warnings.filterwarnings('ignore')

# Conncet to Servce

In [2]:
try:
    connection = pymysql.connect(
        host="aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com",
        port=3306,
        user=input("Enter username: "),
        password=getpass("Enter password: "),
        database="sql_yelp",
    )
    print("MySQL Database connection successful")
except Error as err:
    print(f"Error: '{err}'")

Enter username: admin
Enter password: ········
MySQL Database connection successful

In [3]:
cursor = connection.cursor()

In [4]:
test_query = """SELECT name, city, state, categories FROM sql_yelp.BUSINESS 
WHERE state = 'IL' 
AND categories like 'Restaurants'
LIMIT 100;"""
restaurant = cursor.execute(test_query)
restaurant = cursor.fetchall()
restaurant[:2]

(('Grace Manor Restaurant', 'Edwardsville', 'IL', 'Restaurants'),
 ('Dairyland', 'Dupo', 'IL', 'Restaurants'))

# Using SQL Magic

In [12]:
%%capture
%load_ext sql
%sql mysql+pymysql://admin:HelloWorld@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp

In [13]:
%%sql

SELECT name, city, state, categories FROM BUSINESS 
WHERE state = 'IL' 
AND categories like '%Restaurants%'
LIMIT 100;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
3 rows affected.

[('Grace Manor Restaurant', 'Edwardsville', 'IL', 'Restaurants'),
 ('Dairyland', 'Dupo', 'IL', 'Restaurants'),
 ("Moore's Restaurant", 'Belleville', 'IL', 'Restaurants')]

## Business

In [22]:
query = """SELECT name, city, state, postal_code, latitude, longitude, stars, review_count, is_open, categories, hours FROM sql_yelp.BUSINESS 
WHERE categories like '%Restaurants%';"""

ResturantDF = pd.read_sql(query, connection)
ResturantDF.head()

,name,city,state,postal_code,latitude,longitude,stars,review_count,is_open,categories,hours
0,St Honore Pastries,Philadelphia,PA,19107,39.955505,-75.155564,4.0,80,1,"Restaurants, Food, Bubble Tea, Coffee & Tea, B...","{""Friday"": ""7:0-21:0"", ""Monday"": ""7:0-20:0"", ""..."
1,Sonic Drive-In,Ashland City,TN,37015,36.269593,-87.058943,2.0,6,1,"Burgers, Fast Food, Sandwiches, Food, Ice Crea...","{""Friday"": ""9:0-0:0"", ""Monday"": ""0:0-0:0"", ""Su..."
2,Tsevi's Pub And Grill,Affton,MO,63123,38.565165,-90.321087,3.0,19,0,"Pubs, Restaurants, Italian, Bars, American (Tr...",null
3,Sonic Drive-In,Nashville,TN,37207,36.208102,-86.768170,1.5,10,1,"Ice Cream & Frozen Yogurt, Fast Food, Burgers,...","{""Friday"": ""6:0-16:0"", ""Monday"": ""0:0-0:0"", ""S..."
4,Vietnamese Food Truck,Tampa Bay,FL,33602,27.955269,-82.456320,4.0,10,1,"Vietnamese, Food, Restaurants, Food Trucks","{""Friday"": ""11:0-14:0"", ""Monday"": ""11:0-14:0"",..."

In [43]:
%%sql
SELECT stars, count(*) FROM BUSINESS 
WHERE categories like '%Restaurants%'
AND is_open=1
GROUP BY stars
ORDER BY stars DESC;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
9 rows affected.

[(5.0, 1151),
 (4.5, 6057),
 (4.0, 9183),
 (3.5, 7330),
 (3.0, 4569),
 (2.5, 3154),
 (2.0, 2160),
 (1.5, 1194),
 (1.0, 189)]

In [45]:
%%sql
SELECT stars, count(*) FROM BUSINESS 
WHERE categories like '%Bars%'
AND is_open=1
GROUP BY stars
ORDER BY stars DESC;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
9 rows affected.

[(5.0, 396),
 (4.5, 1982),
 (4.0, 3073),
 (3.5, 2366),
 (3.0, 1172),
 (2.5, 538),
 (2.0, 195),
 (1.5, 30),
 (1.0, 7)]

In [86]:
%%sql
SELECT state, count(*) FROM BUSINESS 
WHERE categories like '%Restaurants%'
AND is_open=1
GROUP BY state
ORDER BY state;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
16 rows affected.

[('AB', 1734),
 ('AZ', 1803),
 ('CA', 668),
 ('DE', 706),
 ('FL', 5920),
 ('HI', 1),
 ('ID', 940),
 ('IL', 723),
 ('IN', 2836),
 ('LA', 2343),
 ('MO', 2723),
 ('NJ', 2415),
 ('NV', 1075),
 ('PA', 8069),
 ('TN', 3030),
 ('XMS', 1)]

In [82]:
%%sql
SELECT COUNT( DISTINCT state) as states
FROM BUSINESS;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
1 rows affected.

[(27,)]

In [81]:
%%sql
SELECT name, city,  stars,  review_count, categories FROM BUSINESS
WHERE state ='PA' 
AND is_open=1
AND stars >=4
ORDER BY review_count DESC, stars DESC
LIMIT 10;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
10 rows affected.

[('Reading Terminal Market', 'Philadelphia', 4.5, 5721, 'Candy Stores, Shopping, Department Stores, Fast Food, Beer, Wine & Spirits, Fruits & Veggies, Chinese, Food, Ice Cream & Frozen Yogurt, Desserts, Sea ... (205 characters truncated) ... nment, Juice Bars & Smoothies, Seafood Markets, Farmers Market, Coffee & Tea, Bakeries, Food Stands, Dinner Theater, Sporting Goods, Grocery, Fashion'),
 ('El Vez', 'Philadelphia', 4.0, 3187, 'Lounges, Bars, Nightlife, Breakfast & Brunch, Mexican, Restaurants'),
 ('Zahav', 'Philadelphia', 4.5, 3065, 'Nightlife, Bars, Food, Ethnic Food, Middle Eastern, Vegetarian, Specialty Food, Israeli, Restaurants'),
 ('Barbuzzo', 'Philadelphia', 4.5, 2893, 'Mediterranean, Restaurants, Pizza, Italian'),
 ('Parc', 'Philadelphia', 4.0, 2761, 'Restaurants, French, Wine Bars, Nightlife, American (New), Bars, Cafes, Breakfast & Brunch'),
 ('Dalessandro’s Steaks & Hoagies', 'Philadelphia', 4.0, 2686, 'Sandwiches, Delis, Restaurants, Cheesesteaks'),
 ('Green Eggs Café', 'Philadelphia', 4.0, 2679, 'Restaurants, American (New), Diners, Breakfast & Brunch'),
 ('Dim Sum Garden', 'Philadelphia', 4.0, 2672, 'Chinese, Restaurants, Dim Sum, Asian Fusion, Shanghainese'),
 ('The Dandelion', 'Philadelphia', 4.0, 2497, 'British, Restaurants, Gastropubs, Bars, Nightlife'),
 ("Tommy DiNic's", 'Philadelphia', 4.0, 2221, 'Restaurants, American (Traditional), Sandwiches')]

In [46]:
%%sql
SELECT state, count(*) FROM BUSINESS 
WHERE categories like '%Bars%'
AND is_open=1
GROUP BY state
ORDER BY state;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
14 rows affected.

[('AB', 383),
 ('AZ', 472),
 ('CA', 232),
 ('DE', 156),
 ('FL', 1879),
 ('ID', 316),
 ('IL', 164),
 ('IN', 710),
 ('LA', 880),
 ('MO', 779),
 ('NJ', 414),
 ('NV', 411),
 ('PA', 2041),
 ('TN', 922)]

# User

In [40]:
%%sql
SELECT * FROM USER
EXCEPT friends
LIMIT 1;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'EXCEPT friends' at line 2")
[SQL: SELECT * FROM USER
EXCEPT friends;]
(Background on this error at: http://sqlalche.me/e/f405)

In [41]:
%%sql
SELECT * INTO temp_user FROM USER
ALTER TABLE temp_user DROP COLUMN friends
SELECT * FROM temp_user;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'ALTER TABLE temp_user DROP COLUMN friends\nSELECT * FROM temp_user' at line 2")
[SQL: SELECT * INTO temp_user FROM USER
ALTER TABLE temp_user DROP COLUMN friends
SELECT * FROM temp_user;]
(Background on this error at: http://sqlalche.me/e/f405)

# Review

In [47]:
%%sql
SELECT * FROM REVIEW
LIMIT 1;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
1 rows affected.

[(0, 'KU_O5udG6zpxOg-VcAEodg', 'mh_-eMZ6K5RLWhZyISBhwA', 'XQfwVwDr-v0ZS3_CbbE5Xw', 3, 0, 0, 0, "If you decide to eat here, just be aware it is going to take about 2 hours from beginning to end. We have tried it multiple times, because I want to  ... (217 characters truncated) ... oo many experiences where we spent way too long waiting. We usually opt for another diner or restaurant on the weekends, in order to be done quicker.", datetime.datetime(2018, 7, 7, 22, 9, 11))]

In [69]:
%%sql
SELECT stars, AVG(useful),AVG(funny),AVG(cool), AVG(LENGTH(text)) as text_length FROM 
(SELECT * FROM REVIEW LIMIT 5000) as temp
GROUP BY stars
ORDER BY stars DESC;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
5 rows affected.

[(5, Decimal('0.7722'), Decimal('0.1567'), Decimal('0.3561'), Decimal('457.7060')),
 (4, Decimal('0.8355'), Decimal('0.2424'), Decimal('0.4518'), Decimal('573.0032')),
 (3, Decimal('0.8449'), Decimal('0.3137'), Decimal('0.2985'), Decimal('603.8212')),
 (2, Decimal('1.0026'), Decimal('0.3636'), Decimal('0.1948'), Decimal('653.2494')),
 (1, Decimal('1.2631'), Decimal('0.5153'), Decimal('0.1694'), Decimal('695.1207'))]

In [76]:
%%sql
SELECT stars, count(stars) FROM REVIEW
GROUP BY stars
ORDER BY stars DESC;

 * mysql+pymysql://admin:***@aws-sql-yelp.cqihthgefggb.us-east-1.rds.amazonaws.com:3306/sql_yelp
5 rows affected.

[(5, 3231627), (4, 1452918), (3, 691934), (2, 544240), (1, 1069561)]